{
  "backend/main.mo": "Main Motoko actor defining SprintPlan/DayPlan types, plan storage with Map, and resource lookup logic per skill/level/day; applies migrations on upgrade via MixinStorage and Migration modules.",
  "backend/migration.mo": "Motoko migration module that updates existing SprintPlan records by backfilling day-level resources using a local getResourcesForDay lookup, transforming OldActor state to NewActor on canister upgrade.",
  "feature_evidence.json": "Empty feature evidence report JSON with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their styling, components, hooks, and pages for build planning reference.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom property tokens for light and dark themes covering background, foreground, card, border, chart, and sidebar colors.",
  "frontend/index.html": "Minimal HTML entry point for the SkillSprint Vite/React app, mounting the React root and loading main.tsx as a module.",
  "frontend/src/App.tsx": "TanStack Router setup with a root route wrapping Layout, a home route for SkillInputForm, and a /plan/$planId route for PlanResults.",
  "frontend/src/components/DownloadPdfButton.tsx": "Button component that opens a print window with a fully styled HTML/CSS sprint plan PDF template including day cards, metadata, resources, and common mistakes.",
  "frontend/src/components/Layout.tsx": "App shell component with a glassmorphism sticky header featuring the SkillSprint logo and AI badge, a main content slot, and a footer with caffeine.ai attribution.",
  "frontend/src/components/PaywallModal.tsx": "Renders a paywall modal that prompts users to pay ₹20 via UPI and submit a transaction ID to unlock a full 7-day sprint plan, using the `useSubmitTransactionId` mutation for verification.",
  "frontend/src/components/ProgressGraph.tsx": "Displays an SVG bar chart showing per-day completion progress across a 7-day sprint, with colored bars and percentage grid lines.",
  "frontend/src/components/ProgressTracker.tsx": "Interactive day-by-day progress tracker for a 7-day sprint that awards XP, tracks streaks, and unlocks badges (streak, halfway, complete) as days are marked done.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating plans, fetching plan data (full and public views), checking unlock status, and submitting UPI transaction IDs against the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Space Grotesk, Syne), sets up Tailwind layers, defines a Gen-Z vibrant OKLCH color palette via CSS variables, and provides utility classes for gradients, glows, shadows, and text effects.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/PlanResults.tsx": "Plan results page that fetches and displays a generated 7-day skill sprint, rendering day cards with objectives/tasks/resources, a progress tracker, progress graph, paywall modal for locked days, and a PDF download button.",
  "frontend/src/pages/SkillInputForm.tsx": "Landing page form that lets users select a skill, set hours per day, choose a skill level, and enter a desired outcome, then submits to generate a sprint plan and navigates to the results page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH color tokens (neon palette, chart, sidebar), typography/container-queries/animate plugins, custom fonts, border radii, and box shadows.",
  "project_state.json": "Project state metadata describing SkillSprint's architecture, existing features, known issues (blank day plan content, missing study resources), and constraints such as manual UPI payment and fixed resource URL mappings."
}