{
  "backend/main.mo": "Motoko actor defining the SkillSprint backend with types for SprintPlan, DayPlan, and BonusResource; generates 7-day skill plans, stores them in a map, and manages payment records with a public/locked plan view distinction.",
  "feature_evidence.json": "Feature evidence report documenting that the createPlan mutation in useQueries.ts and SkillInputForm.tsx correctly distinguishes backend #err variant responses from network errors and surfaces appropriate messages to the user.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose, styling approach, and key functionality for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the SkillSprint React app, setting the page title to '7 Day Skill Builder' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "TanStack Router configuration defining three routes: root (with Layout), home (SkillInputForm), and /plan/$planId (PlanResults).",
  "frontend/src/components/DownloadPdfButton.tsx": "React component rendering a gradient download button that generates a print-ready PDF of the sprint plan, including URL sanitization logic and a SKILL_RESOURCE_MAP to ensure valid bonus resource links.",
  "frontend/src/components/Layout.tsx": "App shell component with a glassmorphism sticky header featuring the SkillSprint logo and AI badge, a main content area, and a footer with caffeine.ai attribution.",
  "frontend/src/components/PaywallModal.tsx": "Renders a paywall modal prompting users to pay ₹20 via UPI to unlock the full 7-day SkillSprint plan, with a copyable UPI ID and a WhatsApp contact link for payment confirmation.",
  "frontend/src/components/ProgressGraph.tsx": "Displays an SVG bar chart showing the user's 7-day sprint progress, with each bar colored per day and filled to 100% when that day is marked complete.",
  "frontend/src/components/ProgressTracker.tsx": "Interactive day-completion tracker that lets users toggle days done, animates XP count-up, tracks streaks, and awards milestone badges (streak, halfway, complete).",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, delegation validity checks, and exposing identity and status to consumers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating a sprint plan (mutation) and fetching full or public plan views (queries) from the ICP backend actor, with structured error message extraction.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Space Grotesk, Syne), sets up Tailwind base/components/utilities, defines a Gen-Z vibrant OKLCH color palette via CSS variables, and provides utility classes for glows, gradients, card shadows, and locked-blur effects.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/PlanResults.tsx": "Plan results page that fetches and displays a generated 7-day skill sprint plan, including day cards, progress tracker, progress graph, and a paywall modal; includes a URL sanitization utility and a lookup table of verified resource URLs for common skills.",
  "frontend/src/pages/SkillInputForm.tsx": "Landing page form that lets users select a skill, set hours per day, choose a skill level, and enter a desired outcome, then submits to create a plan and navigates to the results page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with Space Grotesk/Syne fonts, OKLCH-based semantic color tokens, a vibrant neon color palette, custom border radii, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file (version 35) describing SkillSprint's architecture, existing features, known issues (blank day content, repeated Day 1 placeholders, plan generation errors, broken bonus resource URLs), and the manual UPI-based payment unlock approach."
}