{
  "backend/main.mo": "Main Motoko actor defining SprintPlan and DayPlan types, plan generation logic, and storage maps for plans and payment records, with migration support via MixinStorage.",
  "backend/migration.mo": "Migration module that updates existing SprintPlan records by replacing their bonusResource with validated, skill-specific official documentation URLs using a lookup switch.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: fixing the bonus resource anchor href in PlanResults.tsx and rendering the bonus resource URL as visible text in DownloadPdfButton.tsx's PDF output.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose, styling approach, and key functional details.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the SkillSprint React app, mounting the app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "TanStack Router configuration defining root, home, and /plan/$planId routes wrapped in the Layout component.",
  "frontend/src/components/DownloadPdfButton.tsx": "React component that generates a print-ready PDF of the sprint plan, including URL sanitization helpers and a SKILL_RESOURCE_MAP to ensure the bonus resource always renders a valid HTTPS link as visible text.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a sticky header (logo, nav), a main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/PaywallModal.tsx": "Renders a paywall modal that prompts users to pay ₹20 via UPI and submit a transaction ID to unlock the full 7-day skill plan.",
  "frontend/src/components/ProgressGraph.tsx": "Displays an SVG bar chart showing per-day completion progress across the 7-day sprint, with colored bars and percentage grid lines.",
  "frontend/src/components/ProgressTracker.tsx": "Interactive day-completion tracker with XP counter, streak calculation, and badge awards (streak, halfway, complete) for the 7-day sprint.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating plans, fetching plan/public plan views, checking unlock status, and submitting transaction IDs, with IC/Motoko error message extraction.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind base/components/utilities, defines a Gen-Z vibrant OKLCH color palette via CSS variables, and provides utility classes for gradients, glows, and text effects.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/PlanResults.tsx": "Page component that displays a generated sprint plan's results including day plans, progress tracker, progress graph, paywall modal, and PDF download, with bonus resource URL sanitization and a skill-to-resource lookup table.",
  "frontend/src/pages/SkillInputForm.tsx": "Form page that lets users select a skill, set hours per day, choose a skill level, and enter a desired outcome to generate a learning sprint plan via the createPlan mutation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens, Gen-Z neon palette, typography/container-queries/animate plugins, and custom border radii and box shadows.",
  "project_state.json": "Tracks the SkillSprint project state (version 29), including feature list, architectural notes, and known issues such as blank day-wise plan content and failed plan generation. Serves as the source of truth for build planning and fix requests."
}