{
  "backend/main.mo": "Motoko actor defining the SkillSprint backend with types for SprintPlan, DayPlan, and BonusResource; includes plan generation logic, storage maps for plans and payment records, and functions to create/retrieve plans with public/unlocked views.",
  "feature_evidence.json": "Feature evidence report confirming that the UPI QR code image was saved as a static asset at `frontend/public/assets/generated/upi-qr.png`, with high confidence tied to test REQ-38 and the PaywallModal component.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their purpose, styling approach, and key functionality for build planning reference.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based design tokens for light and dark themes, covering background, foreground, card, border, chart, and sidebar color variables.",
  "frontend/index.html": "Minimal HTML entry point for the SkillSprint React app, setting the page title and mounting the app via `/src/main.tsx`.",
  "frontend/src/App.tsx": "TanStack Router configuration with a root route wrapping the Layout component, a home route for SkillInputForm, and a `/plan/$planId` route for PlanResults.",
  "frontend/src/components/DownloadPdfButton.tsx": "React component rendering a gradient download button that generates a print-ready PDF of the sprint plan, including URL sanitization logic and a skill-to-resource map to ensure valid bonus resource links.",
  "frontend/src/components/Layout.tsx": "App shell component with a glassmorphism sticky header featuring the SkillSprint logo and AI badge, a main content area, and a footer with caffeine.ai attribution.",
  "frontend/src/components/PaywallModal.tsx": "Static paywall modal prompting users to pay ₹20 via UPI (nidhi.aesticare@okhdfcbank), displaying a QR code image, copyable UPI ID, unlock perks list, and a WhatsApp deep-link button for screenshot submission.",
  "frontend/src/components/ProgressGraph.tsx": "Renders an SVG bar chart showing 7-day sprint progress, coloring each bar based on whether that day is marked complete.",
  "frontend/src/components/ProgressTracker.tsx": "Interactive day-completion tracker with XP count-up animation, streak detection, and badge unlocking for a 7-day sprint.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context (login, clear, status) via AuthClient, persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exposes React Query hooks for creating a sprint plan (mutation) and fetching a plan or its public view by ID.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base/utility layers with a Gen-Z vibrant OKLCH color palette and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/PlanResults.tsx": "Displays the generated 7-day skill sprint plan with day-by-day cards, progress tracker, progress graph, bonus resource links (with URL sanitization and a verified skill-resource lookup table), and a paywall modal that permanently locks Days 2–7.",
  "frontend/src/pages/SkillInputForm.tsx": "Landing page form that collects skill selection (preset or custom), hours per day, skill level, and desired outcome, then calls the createPlan mutation and navigates to the plan results page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Space Grotesk, Syne), OKLCH-based color tokens (including a neon Gen-Z palette), border radii, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 33) describing SkillSprint's architecture, known issues (blank day content, plan generation errors, bad bonus resource URLs), existing features, and payment system design (manual UPI/WhatsApp-based unlock, no auto-verification)."
}