{
  "backend/main.mo": "Main Motoko actor defining SprintPlan, DayPlan, and Resource types, with logic to generate and store 7-day skill sprint plans, manage payment records, and expose public/private plan views.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (PaywallModal disclaimer text update, premium redesign) to their source files, component dependencies, and test requirement IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key design/functionality of each component, page, hook, and config file.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the SkillSprint React app, setting the page title and mounting the root div with the main.tsx module entry point.",
  "frontend/src/App.tsx": "TanStack Router setup defining root, home (/), and plan (/plan/$planId) routes wrapped in the Layout component.",
  "frontend/src/components/DownloadPdfButton.tsx": "Button component that opens a print window with a styled HTML representation of the full SprintPlan (days, resources, mistakes) for PDF download.",
  "frontend/src/components/Layout.tsx": "App shell component rendering a sticky glassmorphism header with logo and AI badge, a main content area, and a footer with copyright and caffeine.ai attribution.",
  "frontend/src/components/PaywallModal.tsx": "A modal component that prompts users to pay ₹20 via UPI to unlock a sprint plan, allowing them to copy the UPI ID, enter a transaction ID, and verify payment through a mutation hook.",
  "frontend/src/components/ProgressGraph.tsx": "An SVG bar chart component that visualizes a user's 7-day sprint progress, rendering colored bars at full or minimal height based on which days are marked complete.",
  "frontend/src/components/ProgressTracker.tsx": "An interactive day-completion tracker that lets users toggle days done, calculates XP and streaks, and awards badges (streak, halfway, complete) with animated count-up feedback.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state, persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating plans, fetching full or public plan views, checking unlock status, and submitting UPI transaction IDs against the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that defines a Gen-Z vibrant color palette using OKLCH CSS variables, imports Space Grotesk and Syne fonts via Google Fonts, and provides Tailwind base/component/utility layers plus custom utility classes for gradients, glows, and card shadows.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM root.",
  "frontend/src/pages/PlanResults.tsx": "Plan results page that fetches and displays a generated 7-day skill sprint, rendering day cards with objectives/tasks/resources, a progress tracker, progress graph, paywall modal for locked days, and a PDF download button.",
  "frontend/src/pages/SkillInputForm.tsx": "Landing page form that lets users select a skill, set hours per day, choose a skill level, and enter a desired outcome, then calls the createPlan mutation and navigates to the generated plan results page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with Space Grotesk/Syne fonts, OKLCH-based semantic color tokens, a vibrant neon color palette, custom border radii, and box shadows, while enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file describing SkillSprint's features, architecture, known issues (blank day content, missing resources, placeholder URLs), and versioning for the AI-driven 7-day skill plan builder app."
}