{
  "kind": "build_request",
  "title": "Replace dynamic resource URLs with fixed, real-URL conditional mapping per skill and day",
  "projectName": "SkillSprint",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "In backend/main.mo, replace all dynamic or placeholder resource URL generation logic with a fully hardcoded, structured conditional mapping. For each supported skill — Public Speaking, Python, Excel, UI Design, Photography, Writing — define a static array of exactly 2–3 resource objects (each with title, URL, and descriptor) for each of the 7 days. All URLs must be real, publicly accessible links such as official documentation pages (e.g., docs.python.org), YouTube search URLs (e.g., https://www.youtube.com/results?search_query=python+basics), freeCodeCamp articles, MDN Web Docs, Canva Design School, or Coursera free previews. No example.com, placeholder, or string-interpolated fake URLs are permitted. The conditional mapping must be purely static: skill name and skill level are used as keys to select the appropriate resource variant. Day themes must follow the existing progression: Day 1 = fundamentals/setup, Day 2 = core concept A, Day 3 = core concept B, Day 4 = practice, Day 5 = intermediate application, Day 6 = project/review, Day 7 = final assessment/wrap-up. Where multiple resource variants exist for the same day, skill level (Beginner / Intermediate / Advanced) must determine which variant is selected. For any skill not in the supported list (e.g., custom skill input), fall back to a set of generic but real learning resource links (e.g., YouTube search URL based on skill name, a freeCodeCamp or Khan Academy general learning link) rather than leaving the array empty.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Create a fixed resource mapping system.",
          "For each supported skill (e.g., Public Speaking, Python, Excel), assign predefined resource links for each day.",
          "Do not dynamically fetch links.",
          "Use structured conditional mapping.",
          "Ensure all URLs are real and tested."
        ]
      },
      "acceptanceCriteria": [
        "Every supported skill (Public Speaking, Python, Excel, UI Design, Photography, Writing) has exactly 2–3 resource objects defined per day (Days 1–7) in the backend mapping.",
        "All resource URLs resolve to real, publicly accessible pages — no example.com, localhost, or obviously fake domains appear in any resource entry.",
        "No string interpolation or runtime URL construction is used; all URLs are literal hardcoded strings.",
        "Skill level (Beginner/Intermediate/Advanced) influences resource selection where multiple variants are defined for the same skill+day.",
        "Day themes follow the defined progression (Day 1 = fundamentals … Day 7 = final assessment).",
        "Custom/unsupported skills fall back to a generic set of real resource links rather than an empty array.",
        "All 7 days for each skill return a non-empty resources array when a plan is fetched."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update backend/migration.mo so that on canister upgrade, any existing stored SprintPlans have their per-day resources arrays fully replaced using the new fixed resource mapping defined in REQ-25. Plans whose resources arrays contain example.com URLs, empty strings, or placeholder entries must be updated to the new real resource links. The migration must iterate over all stored plans, re-derive the correct skill/level/day resource mapping, and overwrite the resources field on each DayPlan accordingly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Create a fixed resource mapping system.",
          "Ensure all URLs are real and tested."
        ]
      },
      "acceptanceCriteria": [
        "After a canister upgrade, all previously stored plans no longer contain example.com or placeholder resource URLs.",
        "Each day in every stored plan has 2–3 resource entries populated with real URLs from the new fixed mapping.",
        "Migration completes without runtime errors for plans with any combination of supported and unsupported skill names.",
        "Plans with unsupported/custom skill names receive the generic fallback resource links rather than empty arrays."
      ]
    }
  ],
  "constraints": [
    "Do not use any external API calls or dynamic URL fetching — all resource URLs must be statically defined in the Motoko source.",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any file under frontend/src/components/ui.",
    "URLs must be real and publicly accessible — no example.com, placeholder domains, or obviously fake links."
  ],
  "nonGoals": [
    "Adding new skills beyond the currently supported dropdown list.",
    "Changing the frontend rendering of study resources.",
    "Modifying the paywall, payment flow, or any other backend functionality.",
    "Fetching or scraping resource links at runtime."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}