{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix plan generation failure — debug and resolve backend trap/error in createPlan",
  "requirements": [
    {
      "id": "REQ-40",
      "summary": "Fix error handling in frontend plan creation flow to properly surface backend errors and prevent silent failures",
      "acceptanceCriteria": [
        "When the backend returns an #err variant, the error message from the variant payload is displayed to the user on the SkillInputForm page.",
        "When a network or call-level error occurs, a clear human-readable fallback error message is shown.",
        "No silent navigation to the PlanResults page occurs when plan generation has failed.",
        "The 'Generate My Sprint' button re-enables after an error so the user can retry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the createPlan mutation to return the full Result type from the backend (either { ok: bigint } or { err: string }) instead of just the planId. Modify the mutation function to properly handle both success and error variants from the backend, throwing an Error with the backend error message when an #err variant is returned so it can be caught by the mutation's onError handler."
        },
        {
          "path": "frontend/src/pages/SkillInputForm.tsx",
          "operation": "modify",
          "description": "Add local error state to display backend and network errors. Update the createPlan mutation's onError handler to set the error message from either the backend #err variant payload or a fallback network error message. Ensure the loading state is reset after errors so the 'Generate My Sprint' button re-enables. Only navigate to PlanResults on successful plan creation (onSuccess). Display the error message prominently above the form when present, and clear it when the user retries."
        }
      ]
    }
  ]
}